cask_args appdir: "/Applications"

tap "homebrew/bundle"
tap "caskroom/cask" || true
tap "caskroom/fonts" || true
tap "neovim/neovim" || true

brew "fzf"
brew "ripgrep"
brew "git"
brew "neovim"
brew "reattach-to-user-namespace"
brew "scmpuff"
brew "thefuck"
brew "tmux"
brew "watchman"
brew "wget"
brew "alacritty"
brew "kitty"

# Casks
cask "font-hack"
# cask "sauce-connect"
cask "1password"
cask "firefox"
cask "google-chrome"
cask "slack"
cask "docker"
cask "chromedriver"

# Mac App Store
brew "mas"
# mas "Xcode", id: 497799835
mas "Divvy", id: 413857545
# mas "Wunderlist", id: 410628904
