cask_args appdir: "/Applications"

tap "homebrew/bundle"
tap "neovim/neovim" || true

brew "fzf"
brew "ripgrep"
brew "fd"
brew "bat"
brew "viu"
brew "git"
brew "neovim", args: ['HEAD']
brew "reattach-to-user-namespace"
brew "scmpuff"
brew "thefuck"
brew "tmux"
brew "watchman"
brew "wget"
brew "volta"
brew "gh"
brew "git-delta"                      # for git diffing
brew "stylua"                         # lua formatting
brew "node"
brew "prettierd"

# Casks
# cask "alacritty"
# cask "kitty"
cask "ghostty"

# cask "font-hack"
# cask "font-hack-nerd-font"
cask "font-fira-code-nerd-font"
cask "1password"
cask "firefox"
cask "google-chrome"
cask "slack"
# cask "docker"
cask "chromedriver"
cask "visual-studio-code"
cask "whatsapp@beta"
cask "wireguard"

### Mac App Store ###
brew "mas"
mas "WireGuard", id: 1451685025
# mas "Xcode", id: 497799835
# mas "Divvy", id: 413857548 # Doesn't support Apple Silicon
# mas "1Password for Safari", id: 1569813296 # 1password Safari extension
# mas "WhatsApp Desktop", id: 1147396723

